app/controllers/albums_controller.rb

  def index
    if (params[:q])
      @albums = @q.result(distinct: true)
    else
      @albums = Album.all
---
SELECT "albums".* FROM "albums"