app/controllers/albums_controller.rb

  def index
      @albums = Album.where(user_id: current_user.id)
---
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = 2

  def create
    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("created_at", "description", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 17 May 2014 12:47:10 UTC +00:00], ["description", ""], ["name", ""], ["updated_at", Sat, 17 May 2014 12:47:10 UTC +00:00], ["user_id", nil]]

  def update
    @album = Album.find(params[:id])

    respond_to do |format|
      if @album.update_attributes(params[:album])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "albums" SET "description" = 'Trip to Chile in March 2014 & Patagonia', "updated_at" = '2014-05-18 13:12:19.033049' WHERE "albums"."id" = 1