app/controllers/pictures_controller.rb

  def index
    @pictures = @album.pictures.all
---
SELECT "pictures".* FROM "pictures" JOIN taggings pictures_taggings_f9d9963 ON pictures_taggings_f9d9963.taggable_id = "pictures".id AND pictures_taggings_f9d9963.taggable_type = 'Picture' AND pictures_taggings_f9d9963.tag_id = 4

  def create

    params[:picture][:picture_image].each do |picture|
      @picture = @album.pictures.create(name: params[:picture][:name], picture_image: picture, tag_list: params[:picture][:tag_list])
---
INSERT INTO "pictures" ("altitude", "camera_make", "camera_model", "created_at", "datetime", "exposure", "flash", "focal_length", "image", "image_height", "image_length", "latitude", "longitude", "name", "orientation", "picture_image", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
INSERT INTO "tags" ("name", "taggings_count") VALUES ($1, $2) RETURNING "id"  [["name", "Profile"], ["taggings_count", 0]]

  def show
    @picture = @album.pictures.find(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", "1"]]

  def destroy
    @picture = @album.pictures.find(params[:id])
    @picture.destroy
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 1]]

  def edit
    @picture = @album.pictures.find(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    # breaking because of EXIF initializer in the model
    @picture = @album.pictures.find(params[:id])

    respond_to do |format|
      if @picture.update_attributes(params[:picture])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "pictures" SET "name" = 'Test 1', "updated_at" = '2014-05-17 14:45:43.743604' WHERE "pictures"."id" = 1